---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsFamilyContentTakeoffLength
source: html/f65c8483-9d6c-32c8-29be-1d1cb7757e36.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsFamilyContentTakeoffLength Property

"Takeoff Length"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsFamilyContentTakeoffLength { get; }
```